app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL
---
  def index
    render json: Task.all

INSERT INTO "tasks" ("name", "description", "end_time", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @task = Task.new(task_params.merge(user: current_user))
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_task
    @task = Task.find(params[:id])