app/models/task.rb

  def soft_delete
    self.update(deleted_at: Time.current)
---
UPDATE "tasks" SET "deleted_at" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["deleted_at", "2019-08-26 02:07:30.639554"], ["updated_at", "2019-08-26 02:07:30.661051"], ["id", 6]]